Here's the run. I have minio running on a server bare-metal (not docker)

--- main.tf ---

terraform {
  required_providers {
    minio = {
      source = "aminueza/minio"
      version = "1.10.0"
    }
  }
}

provider "minio" {
  alias          = "atlas"
}

resource "minio_s3_bucket" "bucket" {
  bucket        = "test-bucket"
  acl           = "private"
}

--- end main.tf ---

$ mc ls s3
[2023-01-07 20:55:18 EST]     0B loki/
[2023-01-07 20:48:07 EST]     0B outline/
[2023-01-07 20:55:18 EST]     0B postgresql/
[2023-01-07 20:55:18 EST]     0B thanos/
[2023-01-07 20:55:18 EST]     0B volsync/

$ terraform plan

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # minio_s3_bucket.bucket will be created
  + resource "minio_s3_bucket" "bucket" {
      + acl                = "private"
      + arn                = (known after apply)
      + bucket             = "test-bucket"
      + bucket_domain_name = (known after apply)
      + force_destroy      = false
      + id                 = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't guarantee to take exactly these actions if you run "terraform apply" now.
$ terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # minio_s3_bucket.bucket will be created
  + resource "minio_s3_bucket" "bucket" {
      + acl                = "private"
      + arn                = (known after apply)
      + bucket             = "test-bucket"
      + bucket_domain_name = (known after apply)
      + force_destroy      = false
      + id                 = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

minio_s3_bucket.bucket: Creating...
minio_s3_bucket.bucket: Creation complete after 1s [id=test-bucket]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
$ mc ls s3
[2023-01-07 20:55:18 EST]     0B loki/
[2023-01-07 20:48:07 EST]     0B outline/
[2023-01-07 20:55:18 EST]     0B postgresql/
[2023-01-08 15:08:19 EST]     0B test-bucket/
[2023-01-07 20:55:18 EST]     0B thanos/
[2023-01-07 20:55:18 EST]     0B volsync/
$ terraform destroy
minio_s3_bucket.bucket: Refreshing state... [id=test-bucket]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  - destroy

Terraform will perform the following actions:

  # minio_s3_bucket.bucket will be destroyed
  - resource "minio_s3_bucket" "bucket" {
      - acl                = "private" -> null
      - arn                = "arn:aws:s3:::test-bucket" -> null
      - bucket             = "test-bucket" -> null
      - bucket_domain_name = "http://atlas/minio/test-bucket" -> null
      - force_destroy      = false -> null
      - id                 = "test-bucket" -> null
    }

Plan: 0 to add, 0 to change, 1 to destroy.

Do you really want to destroy all resources?
  Terraform will destroy all your managed infrastructure, as shown above.
  There is no undo. Only 'yes' will be accepted to confirm.

  Enter a value: yes

minio_s3_bucket.bucket: Destroying... [id=test-bucket]
minio_s3_bucket.bucket: Destruction complete after 0s

Destroy complete! Resources: 1 destroyed.

$ mc ls s3
[2023-01-07 20:55:18 EST]     0B loki/
[2023-01-07 20:48:07 EST]     0B outline/
[2023-01-07 20:55:18 EST]     0B postgresql/
[2023-01-07 20:55:18 EST]     0B thanos/
[2023-01-07 20:55:18 EST]     0B volsync/

$ mc mb --region ca-wat-1 s3/test-bucket
Bucket created successfully `s3/test-bucket`.
$ mc ls s3
[2023-01-07 20:55:18 EST]     0B loki/
[2023-01-07 20:48:07 EST]     0B outline/
[2023-01-07 20:55:18 EST]     0B postgresql/
[2023-01-08 15:09:41 EST]     0B test-bucket/
[2023-01-07 20:55:18 EST]     0B thanos/
[2023-01-07 20:55:18 EST]     0B volsync/
$ terraform plan

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # minio_s3_bucket.bucket will be created
  + resource "minio_s3_bucket" "bucket" {
      + acl                = "private"
      + arn                = (known after apply)
      + bucket             = "test-bucket"
      + bucket_domain_name = (known after apply)
      + force_destroy      = false
      + id                 = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't guarantee to take exactly these actions if you run "terraform apply" now.
$ terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # minio_s3_bucket.bucket will be created
  + resource "minio_s3_bucket" "bucket" {
      + acl                = "private"
      + arn                = (known after apply)
      + bucket             = "test-bucket"
      + bucket_domain_name = (known after apply)
      + force_destroy      = false
      + id                 = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

minio_s3_bucket.bucket: Creating...
╷
│ Error: [FATAL] bucket already exists! (test-bucket): <nil>
│
│   with minio_s3_bucket.bucket,
│   on main.tf line 14, in resource "minio_s3_bucket" "bucket":
│   14: resource "minio_s3_bucket" "bucket" {
│
